# Використовуємо офіційний образ Node.js з тегом 'current' для останньої версії
FROM node:22

# Встановлюємо робочий каталог всередині контейнера
WORKDIR /app

# Копіюємо package.json та package-lock.json до контейнера
COPY package*.json ./

# Встановлюємо залежності
RUN npm install && npm install -g pnpm

# Копіюємо всі файли проєкту до робочого каталогу в контейнері
COPY . .

# Вказуємо порт, який буде використовуватись контейнером
EXPOSE 3000

# Команда для запуску додатку
CMD ["npm","run" ,"dev"]